feat: add flow chart, sequence diagram and usecase diagram
